spec/fixtures/soap/xml/IControl.LocalLB.VirtualServer.set_snat_pool_592e995d8a1c8ad919feea7ee77bacd4_request.xml

<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="urn:iControl:LocalLB/VirtualServer"><env:Body><wsdl:set_snat_pool><virtual_servers><value>test_virtual_server_nil</value></virtual_servers><snatpools><item>test_snat</item></snatpools></wsdl:set_snat_pool></env:Body></env:Envelope>